Revit 2026 API

# LevelProjectElevation Property

---

Retrieves the elevation relative to project origin, no matter what values of the Elevation Base parameter is set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ProjectElevation { get; }
```
```vb
Public ReadOnly Property ProjectElevation As Double
	Get
```
```cpp
public:
property double ProjectElevation {
	double get ();
}
```
```fsharp
member ProjectElevation : float with get
```

#### Property Value

Double

This read only property returns the elevation relative to project origin.

#### Reference

Level Class

Autodesk.Revit.DB Namespace